<template>

<div >
	<div class="container wrapper">
		<div class="row">
			<div class="offset-2 col-8">
				<div class="title">
					Урок 1
				</div>
			</div>
		</div>
		<div class="row">
			<div class="offset-2 col-8">
				<div class="text">
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
					Текст Текст Текст Текст Текст Текст Текст Текст Текст
				</div>
			</div>
		</div>
		<div class="row">
			<div class="offset-2 col-8">
				<img src="../assets/courseimg.jpg" alt="" class="img">
			</div>
		</div>
	</div>
</div>

</template>

<script>

export default {
	name: "Lesson1",
}
</script>

<style scoped>

.wrapper {
	padding-top: 20px;
	background: #fff;
}
.title {
	display: flex;
	font: 30px Roboto,sans-serif;
	font-weight: 500;
	color: #42484e;
	border-bottom: 1px solid #eee;
	margin: 20px 0;
}
.img {
	width: 100%;
	height: auto;
	margin: 20px 0;
}


</style>
